programming/thrift.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-09-06 三 16:05 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>thrift 笔记</title>
<meta name="generator" content="Org mode">
<meta name="author" content="赵文彬">
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">thrift 笔记</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org26929fd">说明</a></li>
<li><a href="#org7c8b96b">类型系统</a></li>
<li><a href="#orgf4283f8">协议栈</a></li>
<li><a href="#org830347e">语法及命令</a></li>
<li><a href="#org2e346dd">开发</a></li>
<li><a href="#orgb3afd3f">参考资料</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org26929fd" class="outline-2">
<h2 id="org26929fd">说明</h2>
<div class="outline-text-2" id="text-org26929fd">
<p>
thrift 是软件栈，提供了跨语言的 RPC 功能。
</p>

<p>
通过编写 <code>.thrift</code> 描述文件，通过 thrift 编译器生成相关语言的 client 和 server 代码，封装了数据传输、序列化、应用级处理相关内容。
</p>

<p>
基本的 thrift 描述文件中定义了新的数据类型，以及 service interface 
</p>
</div>
</div>

<div id="outline-container-org7c8b96b" class="outline-2">
<h2 id="org7c8b96b">类型系统</h2>
<div class="outline-text-2" id="text-org7c8b96b">
</div><div id="outline-container-orge260e70" class="outline-3">
<h3 id="orge260e70">基本类型</h3>
<div class="outline-text-3" id="text-orge260e70">
<p>
如 <code>bool</code>, <code>byte</code>, <code>i16</code>, <code>i32</code>, <code>i64</code>, <code>double</code>, <code>string</code> 。不支持 <code>unsigned</code> 修饰
</p>
</div>
</div>

<div id="outline-container-org32a7700" class="outline-3">
<h3 id="org32a7700">特殊类型</h3>
<div class="outline-text-3" id="text-org32a7700">
<dl class="org-dl">
<dt><code>binary</code></dt><dd>未编码过的二进制序列</dd>
</dl>
</div>
</div>

<div id="outline-container-org0344f8c" class="outline-3">
<h3 id="org0344f8c">结构体</h3>
<div class="outline-text-3" id="text-org0344f8c">
<p>
关键字为 <code>struct</code> ，与 C 的相似
</p>

<ul class="org-ul">
<li>有多个成员</li>
<li>需要指定其类型</li>
</ul>

<p>
不同之处在于
</p>

<ul class="org-ul">
<li>有唯一的标识 id （用于版本管理）</li>
<li>可以指定 optional （类似于 java 中的 transient，不会序列化）</li>
</ul>
</div>
</div>

<div id="outline-container-org64b37d7" class="outline-3">
<h3 id="org64b37d7">容器</h3>
<div class="outline-text-3" id="text-org64b37d7">
<p>
有三种
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">type</th>
<th scope="col" class="org-left">java type</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">list</td>
<td class="org-left">ArrayList</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">set</td>
<td class="org-left">HashSet</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">map</td>
<td class="org-left">HashMap</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2ce04fd" class="outline-3">
<h3 id="org2ce04fd">异常</h3>
<div class="outline-text-3" id="text-org2ce04fd">
<p>
类似于 scala 中的 case class 构造方法
</p>
</div>
</div>

<div id="outline-container-org20b2b6b" class="outline-3">
<h3 id="org20b2b6b">services</h3>
<div class="outline-text-3" id="text-org20b2b6b">
<p>
翻译成 java 中的 interface，提供如下功能
</p>

<ul class="org-ul">
<li>包括一组具名函数，函数有参数列表和返回类型，可以抛出异常</li>
<li>定义的只是接口，需要具体语言通过扩展 <code>iface</code> 来实现</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgf4283f8" class="outline-2">
<h2 id="orgf4283f8">协议栈</h2>
<div class="outline-text-2" id="text-orgf4283f8">
</div><div id="outline-container-org29cc98e" class="outline-3">
<h3 id="org29cc98e">Runtime Library</h3>
<div class="outline-text-3" id="text-org29cc98e">
<p>
包括两部分：
</p>

<ul class="org-ul">
<li>protocol，指定序列化方法</li>
<li>transport, 指定传输方式（提供远程读写的管线）</li>
</ul>
</div>

<div id="outline-container-org983fdb0" class="outline-4">
<h4 id="org983fdb0">protocol layer</h4>
<div class="outline-text-4" id="text-org983fdb0">
<ul class="org-ul">
<li><code>TBinaryProtocol</code></li>
<li><code>TCompactProtocol</code></li>
<li><code>TDenseProtocol</code></li>
<li><code>TJSONProtocol</code></li>
<li><code>TSimpleJSONProtocol</code></li>
<li><code>TDebugProtocol</code></li>
</ul>
</div>
</div>

<div id="outline-container-org0b7a87d" class="outline-4">
<h4 id="org0b7a87d">transport layer</h4>
<div class="outline-text-4" id="text-org0b7a87d">
<ul class="org-ul">
<li><code>TSocket</code></li>
<li><code>TFramedTransport</code></li>
<li><code>TFileTransport</code></li>
<li><code>TMemoryTransport</code></li>
<li><code>TZlibTransport</code></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgbeeb9d2" class="outline-3">
<h3 id="orgbeeb9d2">Processor</h3>
<div class="outline-text-3" id="text-orgbeeb9d2">
<p>
封装 <code>Handler</code> （Handler 为用户按照 thrift service 定义实现类）。作用是对输入请求进行处理，生成输出。用在 Server 中。
</p>
</div>
</div>

<div id="outline-container-orga0ec298" class="outline-3">
<h3 id="orga0ec298">Server</h3>
<div class="outline-text-3" id="text-orga0ec298">
<p>
提供了服务端的几种实现，用于响应客户端请求，调用 Process 处理
</p>

<p>
可用的实现有
</p>

<ul class="org-ul">
<li><code>TSimpleServer</code></li>
<li><code>TThreadPoolServer</code></li>
<li><code>TNonblockingServer</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org830347e" class="outline-2">
<h2 id="org830347e">语法及命令</h2>
<div class="outline-text-2" id="text-org830347e">
<ul class="org-ul">
<li>使用 <code>thrift --gen &lt;type&gt; &lt;thrift-file&gt;</code> 来生成语言相关代码</li>
<li><code>include &lt;thrift-file&gt;</code> 来包含其他的 thrift 文件，并用文件名作为 namespace 访问</li>
<li><code>enum</code> 定义枚举，从 1 开始</li>
<li>services 中可以使用 <code>extends</code> 来扩展其它服务定义的函数</li>
<li>函数 <code>oneway</code> 修饰符，用于表示客户端单向请求，不需要回应</li>
<li><code>typedef</code> 定义别名</li>
<li><code>map&lt;string,string&gt;</code> 常量定义可用 JSON 字面量来初始化</li>
</ul>
</div>
</div>

<div id="outline-container-org2e346dd" class="outline-2">
<h2 id="org2e346dd">开发</h2>
<div class="outline-text-2" id="text-org2e346dd">
</div><div id="outline-container-org0e8232e" class="outline-3">
<h3 id="org0e8232e">Server</h3>
<div class="outline-text-3" id="text-org0e8232e">
<ul class="org-ul">
<li>最终目标是定义一个 TServer 实例，并调用其 <code>server</code> 方法启动监听</li>
<li><code>TServer</code> 有多种实现，如 <code>TSimpleServer</code>, <code>TThreadPoolServer</code> 等</li>
<li>Server 需要指定端口号，及 <code>Processor</code></li>
<li><code>Processor</code> 为服务的 Handler 实现的封装</li>
</ul>
</div>
</div>

<div id="outline-container-orgf0ba34a" class="outline-3">
<h3 id="orgf0ba34a">Client</h3>
<div class="outline-text-3" id="text-orgf0ba34a">
<ul class="org-ul">
<li>与 Server 建立连接，并进行远程方法调用</li>
<li>用 <code>Service.Client( protocol )</code> 生成连接实例</li>
<li>protocol 指定 transport 方式（ socket 或其它）</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb3afd3f" class="outline-2">
<h2 id="orgb3afd3f">参考资料</h2>
<div class="outline-text-2" id="text-orgb3afd3f">
<ul class="org-ul">
<li><a href="http://thrift-tutorial.readthedocs.io/en/latest/index.html">Thrift Tutorial</a></li>
<li>thrift 源码 tutorial 代码</li>
<li><a href="http://jnb.ociweb.com/jnb/jnbJun2009.html">Apache Thrift</a></li>
<li><a href="http://thrift.apache.org/static/files/thrift-20070401.pdf">Thrift: Scalable Cross-Language Services Implementation</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 赵文彬</p>
<p class="date">Created: 2017-09-06 三 16:05</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
